workspace/docs/index.md
```seqdiag
seqdiag {
  activation = none;

  Propietario;
  SIVIA;
  SistemaBaseDatos;
  CamarasVision;
  MotorIA;
  DirectorCDA;

  Propietario -> SIVIA [label = "Agendar Cita"];
  SIVIA -> Propietario [label = "Solicitar Documentos"];
  Propietario -> SIVIA [label = "Subir Documentación"];
  SIVIA -> Propietario [label = "Confirmar Cita"];
  Propietario -> SIVIA [label = "Entrega vehículo en CDA"];
  SIVIA -> SistemaBaseDatos [label = "Identificar tipología del vehículo"];
  SIVIA -> CamarasVision [label = "Capturar imágenes"];
  SIVIA -> MotorIA [label = "Análisis NTC 5375 (6.1 y 6.4)"];
  SIVIA -> DirectorCDA [label = "Enviar checklist y resultados"];
  DirectorCDA -> SIVIA [label = "Aprobar Resultados"];
  SIVIA -> Propietario [label = "Notificaciones estado de inspección"];
}
```
